// 18. *На вход подается строка чисел произвольной длины. Необходимо обратиться к
// каждому значению числа и выявить четность/нечетность
// 1234 -> 1 неч 2 чет 3 неч 4 чет
// 444444 -> 4 чет 4 чет 4 чет 4 чет 4 чет 4 чет
// const striing: string = '123456434334';
// let result: string = ''
// for (let i = 0; i < striing.length; i++) {
//     if (striing[i] % 2 == 0) {
//         result += striing[i] + ' чет '
//     } else{
//         result += striing[i] + ' неч '
//     }
// }
// console.log(result);
